Revit 2026 API

# RenderingQualitySettingsLightAndMaterialAccuracyMode Property

---

A value that controls light and material accuracy mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode { get; set; }
```
```vb
Public Property LightAndMaterialAccuracyMode As LightAndMaterialAccuracyMode
	Get
	Set
```
```cpp
public:
property LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode {
	LightAndMaterialAccuracyMode get ();
	void set (LightAndMaterialAccuracyMode value);
}
```
```fsharp
member LightAndMaterialAccuracyMode : LightAndMaterialAccuracyMode with get, set
```

#### Property Value

LightAndMaterialAccuracyMode

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

The method of the renderer engine dealing with materials and shadows.

#### Reference

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace